admbase/src/Documents/СтоловаяPerco/СтоловаяPerco.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СтоловаяPerco</name>
  <registerRecords>AccumulationRegister.ПосещенияСтоловойPerco</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ИсходныеДанные</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидСтола</name>
      <type>
        <types>EnumRef.ВидыСтолов</types>
      </type>
    </attributes>
    <attributes>
      <name>УчтенноеВремя</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

admbase/src/InformationRegisters/КалендарьМеню/КалендарьМеню.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КалендарьМеню</name>
  <resources>
    <name>Меню</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидСтола</name>
    <type>
      <types>EnumRef.ВидыСтолов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

admbase/src/AccumulationRegisters/ПосещенияСтоловойPerco/ПосещенияСтоловойPerco.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПосещенияСтоловойPerco</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>КатегорияМеню</name>
    <type>
      <types>CatalogRef.КатегорииМеню</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидСтола</name>
    <type>
      <types>EnumRef.ВидыСтолов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Меню</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

admbase/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ВидНоменклатуры</name>
    <type>
      <types>CatalogRef.ВидыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСтола</name>
    <type>
      <types>EnumRef.ВидыСтолов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаДляРецептов</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияМеню</name>
    <type>
      <types>CatalogRef.КатегорииМеню</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоБлюд</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДляМеню</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДляРецептов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СодержитЕдиницХранения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостояниеБлюда</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СоставНабора</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>кКал</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

admbase/src/Documents/СтоловаяPerco/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
	     Возврат;
	КонецЕсли;
	
	ТекстСообщения = Новый Массив;
	//Если РежимЗаписи = РежимЗаписиДокумента.Проведение И Не КалендарьЗаполнен(ТекстСообщения) Тогда
	//	Отказ = Истина;
	//КонецЕсли;	
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение И Не ПроверкаДвойнойЗаписи(ТекстСообщения) Тогда
		Отказ = Истина;
	КонецЕсли;
	
	Если ТекстСообщения.Количество() > 0 Тогда
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = СтрСоединить(ТекстСообщения,Символы.ПС);
		СообщениеПользователю.Сообщить();
	КонецЕсли;
	
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	
#Область ТекстЗапроса
	
Запрос.Текст = "ВЫБРАТЬ
|	СтоловаяPercoИсходныеДанные.Сотрудник КАК Сотрудник,
|	СтоловаяPercoИсходныеДанные.Дата КАК Период,
|	СтоловаяPercoИсходныеДанные.ВидСтола КАК ВидСтола,
|	КалендарьМеню.Меню КАК Меню,
|	Номенклатура.КатегорияМеню КАК КатегорияМеню,
|	1 КАК Количество
|ИЗ
|	Документ.СтоловаяPerco.ИсходныеДанные КАК СтоловаяPercoИсходныеДанные
|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СтоловаяPerco КАК СтоловаяPerco
|		ПО СтоловаяPercoИсходныеДанные.Ссылка = СтоловаяPerco.Ссылка
|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КалендарьМеню КАК КалендарьМеню
|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
|			ПО КалендарьМеню.Меню = Номенклатура.Ссылка
|		ПО СтоловаяPercoИсходныеДанные.Дата = КалендарьМеню.Дата
|			И СтоловаяPercoИсходныеДанные.ВидСтола = КалендарьМеню.ВидСтола
|ГДЕ
|	СтоловаяPercoИсходныеДанные.Ссылка = &Ссылка
|	И СтоловаяPercoИсходныеДанные.Сотрудник.ПометкаУдаления = ЛОЖЬ
|
|УПОРЯДОЧИТЬ ПО
|	СтоловаяPercoИсходныеДанные.НомерСтроки";
	
#КонецОбласти

	Движения.ПосещенияСтоловойPerco.Записывать = Истина;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Движения.ПосещенияСтоловойPerco.Добавить(),Выборка)
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПроверкаДвойнойЗаписи(ТекстСообщения)
	
	Если Не ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Истина)
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИсходныеДанные",ИсходныеДанные.Выгрузить()); 
	Запрос.УстановитьПараметр("Регистратор",Ссылка);
	
#Область ТекстЗапроса

Запрос.Текст = "ВЫБРАТЬ
|	СтоловаяPercoИсходныеДанные.Сотрудник КАК Сотрудник,
|	СтоловаяPercoИсходныеДанные.Дата КАК Дата
|ПОМЕСТИТЬ ЗагружаемыеДанные
|ИЗ
|	&ИсходныеДанные КАК СтоловаяPercoИсходныеДанные
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	ПосещенияСтоловойPercoОбороты.Сотрудник КАК Сотрудник,
|	ПосещенияСтоловойPercoОбороты.Дата КАК Дата,
|	ПосещенияСтоловойPercoОбороты.КоличествоОборот КАК КоличествоОборот
|ПОМЕСТИТЬ ДанныеРегистра
|ИЗ
|	РегистрНакопления.ПосещенияСтоловойPerco.Обороты(
|			,
|			,
|			Авто,
|			(Сотрудник, Дата) В
|				(ВЫБРАТЬ
|					ЗагружаемыеДанные.Сотрудник КАК Сотрудник,
|					ЗагружаемыеДанные.Дата КАК Дата
|				ИЗ
|					ЗагружаемыеДанные КАК ЗагружаемыеДанные)) КАК ПосещенияСтоловойPercoОбороты
|ГДЕ
|	ПосещенияСтоловойPercoОбороты.Регистратор <> &Регистратор
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ РАЗЛИЧНЫЕ
|	ДанныеРегистра.Сотрудник КАК Сотрудник,
|	ДанныеРегистра.Дата КАК Дата
|ИЗ
|	ДанныеРегистра КАК ДанныеРегистра
|
|УПОРЯДОЧИТЬ ПО
|	Сотрудник,
|	Дата";
	
#КонецОбласти

Результат = Запрос.Выполнить();

Если Результат.Пустой() Тогда
	Возврат Истина
КонецЕсли;

ТекстСообщения.Добавить("ДВОЙНАЯ ЗАГРУЗКА ДАННЫХ ПО СОТРУДНИКАМ");
Выборка = Результат.Выбрать();
Пока Выборка.Следующий() Цикл
	ТекстСообщения.Добавить(СтрШаблон("%1 от %2",Строка(Выборка.Сотрудник),Формат(Выборка.Дата,"ДЛФ=ДД")));
КонецЦикла;

Возврат Ложь;
	
	
КонецФункции // ПроверкаДвойнойЗаписи()

#КонецОбласти 

#КонецЕсли
